Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: Enter the I2C file folder and select open I2C.py file.
it_it: Accedere alla cartella dei file I2C e selezionare il file "I2C.py".

source: Enter the ID of the first module connected to the bus and the ID of the last module connected to the bus here.
it_it: Inserire qui l'ID del primo modulo collegato al bus e l'ID dell'ultimo modulo collegato al bus.

source: Enter the SPI example directory, and edit the demo CH347T_Config.py.
it_it: Accedere alla directory di esempio SPI e modificare il file demo CH347T_Config.py.

source: Enter the UART example directory, and edit the program UART.py.
it_it: Accedere alla directory di esempio UART e modificare il programma UART.py.

source: Enter the code:
it_it: Immettere il codice:

source: Enter the data to be sent in the SPI input box and select SPI Read, SPI Write or SPI Read/Write according to the desired operation.
it_it: Inserire i dati da inviare nella casella di input SPI e selezionare "SPI Read", "SPI Write" o "SPI Read/Write" in base all'operazione desiderata.

source: Enter the downloaded file, "../USB-TO-UART-I2C-SPI-JTAG-Demo/Raspberry/Code/lib/XXX" (XXX: select the file folder according to the above query result).
it_it: Immettere il file scaricato, "../USB-TO-UART-I2C-SPI-JTAG-Demo/Raspberry/Code/lib/XXX" (XXX: selezionare la cartella del file in base al risultato della query sopra).

source: Enter the driver file directory:
it_it: Immettere la directory del file del driver:

source: Enter the index and the bank number of a local variable and then click the Add button to add it to the list of watches.
it_it: Inserire l'indice e il numero di banco di una variabile locale, quindi cliccare sul pulsante Add per aggiungerla all'elenco dei controlli.

source: Enter the name of the board you want to install ESP32 in the search box;
it_it: Inserire il nome della board su cui installare ESP32 nella casella di ricerca;

source: Enter the node ID of the first module connected to the bus and the node ID of the last module connected to the bus here.
it_it: Inserire qui l'ID nodo del primo modulo collegato al bus e l'ID nodo dell'ultimo modulo collegato al bus.

source: Enter the sample demo "../USB-TO-UART-I2C-SPI-JTAG-Demo/Windows/Code" (Sample demo).
it_it: Inserire l'esempio "../USB-TO-UART-I2C-SPI-JTAG-Demo/Windows/Code" (Sample demo).

source: Entering values
it_it: Inserimento di valori

source: Environment Building
it_it: Preparazione dell'Ambiente

source: Environment Configuration Instructions
it_it: Istruzioni per la Configurazione dell'Ambiente

source: Environment Setting
it_it: Impostazioni dell'Ambiente

source: Environment Setup
it_it: Configurazione dell'Ambiente

source: Environmet Debugging Description
it_it: Descrizione dell'Ambiente di Debug

source: Equipped with high-performance Xtensa 32-bit LX7 dual-core processor, up to 240MHz main frequency
it_it: Dotato di processore dual-core Xtensa LX7 a 32 bit ad alte prestazioni, con frequenza principale fino a 240 MHz

source: Evaluation Board Commands
it_it: Comandi della Evaluation Board

source: Event timer: the event timer of the selected TPDO (given in ms).
it_it: Event timer: il timer evento del TPDO selezionato (espresso in ms).

source: Every time the Step function is selected (by selecting Step in the Debug menu, clicking the Step icon on the tool bar or pressing F7) the next command in the TMCL program will be executed.
it_it: Ogni volta che si seleziona la funzione Step (selezionando Step nel menù Debug, cliccando sull'icona Step sulla barra degli strumenti o premendo F7), verrà eseguito il comando successivo nel programma TMCL.

source: Example
it_it: Esempio

source: Example Reference
it_it: Esempio di Riferimento

source: Execute "program STM32F429_439xx.hex" to download the program (program + parameter: here the parameter is the hex file to be downloaded, you can copy it to the bin folder mentioned in the previous operation, or you need to change the parameter to path + hex file or elf file to be downloaded).
it_it: Eseguire "program STM32F429_439xx.hex" per scaricare il programma (programma + parametro: qui il parametro è il file esadecimale da scaricare, è possibile copiarlo nella cartella bin menzionata nell'operazione precedente, oppure è necessario modificare il parametro in path + file esadecimale o file elf da scaricare).

source: Execute compilation and load the driver:
it_it: Eseguire la compilazione e caricare il driver:

source: Execute demo:
it_it: Eseguire la demo:

source: Execute example:
it_it: Eseguire l'esempio:

source: Execute the demo:
it_it: Eseguire la demo:

source: Execute various debugging commands for functional debugging (e.g. reset, halt, resume, etc.).
it_it: Eseguire vari comandi per il debug funzionale (ad esempio reset, halt, resume, ecc.).

source: Execution then starts from the beginning of the program.
it_it: L'esecuzione parte quindi dall'inizio del programma.

source: Explanations of the EMCY messages used by the individual device can be found in its CANopen firmware manual.
it_it: Le spiegazioni sui messaggi EMCY utilizzati dal singolo dispositivo sono disponibili nel relativo manuale del firmware CANopen.

source: Export to INI: This function reads out all axis parameter settings and stores them in an INI file.
it_it: Export to INI: Questa funzione legge tutte le impostazioni dei parametri degli assi e le memorizza in un file INI.

source: Export to TMCL: This is the main function of this tool.
it_it: Export to TMCL: Questa è la funzione principale di questo strumento.

source: Export/Import: The export/import utility can save the values of all writable registers in different format.
it_it: Export/Import: L'utilità di esportazione/importazione può salvare i valori di tutti i registri scrivibili in diversi formati.

source: External JTAG Interface
it_it: Interfaccia JTAG Esterna

source: Features
it_it: Funzionalità

source: Figure 1: The TMCL-IDE Main Window
it_it: Figura 1: La Finestra Principale di TMCL-IDE

source: Figure 27: The Different Tabs of the Closed Loop Tool
it_it: Figura 27: I Diversi Tab del Tool Closed Loop

source: Figure 10: The CAN Bus Connection Window
it_it: Figura 10: La Finestra di Connessione del bus CAN

source: Figure 11: The Main Module Tool
it_it: Figura 11: Strumento del Modulo Principale

source: Figure 12: The Direct Mode Tool
it_it: Figura 12: Il tool "Direct Mode"

source: Figure 13: The Direct Mode Tool (extended)
it_it: Figura 13: Il Tool "Direct Mode" (esteso)

source: Figure 14 The Global Parameters Tool
it_it: Figura 14 Il Tool "Global Parameters"

source: Figure 15 The TMCL Creator
it_it: Figura 15 Il TMCL Creator

source: Figure 16 The Editor Settings Dialog
it_it: Figura 16 La finestra di dialogo "Editor Settings"

source: Figure 17: Progress of the Assembly
it_it: Figura 17: Avanzamento dell'Assemblaggio

source: Figure 18: TMCL Program Download
it_it: Figura 18: Download del Programma TMCL

source: Figure 19: Program Disassembly
it_it: Figura 19: Disassemblaggio del Programma

source: Figure 20: Assembler/Debugger Options
it_it: Figura 20: Opzioni dell'Assembler/Debugger

source: Figure 21: The TMCL Creator in Debug Mode
it_it: Figura 21: TMCL Creator in Modalità Debug

source: Figure 22: The Settings Export/Import Tool
it_it: Figura 22: Il Tool Settings Export/Import

source: Figure 23: The Parameter Calculator for TMC429 based Stepper Motor Modules
it_it: Figura 23: Il Parameter Calculator per i moduli motore passo-passo basati su TMC429

source: Figure 24: The Parameter Calculator for all other Stepper Motor Modules
it_it: Figura 24: Il "Parameter Calculator" per tutti gli altri moduli motore passo-passo

source: Figure 25: The User Variable Display
it_it: Figura 25: Lo User Variable Display

source: Figure 26: Different Appearances of the Settings Tool
it_it: Figura 26: Diversi Aspetti del Tool Settings

source: Figure 28: The TMCL Tab of the Closed Loop Tool
it_it: Figura 28: Il Tab TMCL del Tool Closed Loop

source: Figure 29: Chopper Settings — Thresholds
it_it: Figura 29: Chopper Settings — I Threshold

source: Figure 2: The Menu an Status Bar
it_it: Figura 2: Barra dei Menu e Barra di Stato

source: Figure 30: Chopper Settings — StealthChop
it_it: Figura 30: Chopper Settings — StealthChop

source: Figure 31: Chopper Settings — SpreadCycle
it_it: Figura 31: Chopper Settings — SpreadCycle

source: Figure 32: Chopper Settings — High Speed
it_it: Figura 32: Chopper Settings — High Speed

source: Figure 33: Chopper Settings — TMCL
it_it: Figura 33: Chopper Settings — TMCL

source: Figure 34: The Velocity Graph
it_it: Figura 34: Il Velocity Graph

source: Figure 35: The Parameter Selection Dialog
it_it: Figura 35: La Dialog Parameter Selection

source: Figure 36: Graph Scaling Options
it_it: Figura 36: Opzioni di Ridimensionamento del Grafico

source: Figure 37: The Position Graph
it_it: Figura 37: Il Position Graph

source: Figure 38: The Torque Graph
it_it: Figura 38: Il Torque Graph

source: Figure 39: Different Appearances of the Velocity Mode Tool
it_it: Figura 39: Diversi Aspetti del Tool Velocity Mode

source: Figure 3: The Menu Bar’s entries
it_it: Figura 3: Voci della Barra dei Menù

source: Figure 40: Different Appearances of the Position Mode Tool
it_it: Figura 40: Diversi Aspetti del Tool Position Mode

source: Figure 41: The Torque Mode for Stepper Motors
it_it: Figura 41: Modalità Torque per i Motori Passo-Passo

source: Figure 42: The Torque Mode for BLDC Motors
it_it: Figura 42: Il "Torque Mode" per Motori BLDC

source: Figure 43: The Axis Parameter Display
it_it: Figura 43: Lo "Axis Parameter Display"

source: Figure 44 shows the StallGuard Adjuster tool.
it_it: La Figura 44 mostra il tool "StallGuard Adjuster".

source: Figure 44: The StallGuard Adjuster
it_it: Figura 44: Lo "StallGuard Adjuster"

source: Figure 45: The StallGuard Profiler
it_it: Figura 45: Il Profiler StallGuard

source: Figure 46: The CoolStep & StallGuard2 Tool
it_it: Figura 46: Il Tool CoolStep & StallGuard2

source: Figure 47: The CoolStep Tab
it_it: Figura 47: Il Tab CoolStep

source: Figure 48: The TMCL Tab
it_it: Figura 48: Il Tab TMCL

source: Figure 49: The BLDC Motor Settings Tool
it_it: Figura 49: Il Tool BLDC Motor Settings

source: Figure 4: The TMCL-IDE About Box
it_it: Figura 4: La finestra About di TMCL-IDE

source: Figure 50: The BLDC Motor Flags Tool
it_it: Figura 50: Il Tool Flags di BLDC Motor

source: Figure 51: The Parameter Display
it_it: Figura 51: Il Parameter Display

source: Figure 52: The Parameter Browser
it_it: Figura 52: Il Parameter Browser

source: Figure 53: Torque tuning tool overview
it_it: Figura 53: Panoramica del tool "Torque tuning"

source: Figure 54 shows the response of the target and actual flux once the tuning is completed:
it_it: La Figura 54 mostra la risposta del flusso target e del flusso effettivo al termine della regolazione:

source: Figure 54: Automatic torque/flux tuning
it_it: Figura 54: Regolazione automatica di "torque/flux" [coppia/flusso]

source: Figure 55: Manual torque/flux tuning
it_it: Figura 55: Regolazione manuale di torque/flux

source: Figure 56 shows the overview of the tuning tool for velocity.
it_it: La Figura 56 mostra la panoramica dello strumento di regolazione della velocità.

source: Figure 56: Velocity tuning tool overview
it_it: Figura 56: Panoramica del tool di regolazione della velocità

source: Figure 57: Automatic Velocity tuning
it_it: Figura 57: Regolazione Automatica della Velocità

source: Figure 58: Manual Velocity tuning
it_it: Figura 58: Regolazione Manuale della Velocità

source: Figure 59 shows the overview of the tuning tool for position.
it_it: La Figura 59 mostra una panoramica dello strumento di regolazione della posizione.

source: Figure 59: Position tuning tool overview
it_it: Figura 59: Panoramica del tool di regolazione della posizione

source: Figure 5: The TMCL-IDE Tool Bar
it_it: Figura 5: La Tool Bar di TMCL-IDE

source: Figure 60: Automatic Position tuning
it_it: Figura 60: Regolazione Automatica della Posizione

source: Figure 61: Manual Position tuning
it_it: Figura 61: Regolazione manuale della Posizione

source: Figure 62: The Main Evaluation Board Tool
it_it: Figura 62: Il Tool Principale della Evaluation Board

source: Figure 63: The Register Browser
it_it: Figura 63: Il Browser dei Registri

source: Figure 64: Changing a Register Value
it_it: Figura 64: Modifica del Valore di un Registro

source: Figure 65: The Flags View
it_it: Figura 65: La "Flags View"

source: Figure 66: The Chip-Click Tool
it_it: Figura 66: Il Tool Chip-Click

source: Figure 67: The Datagram Mode Tool
it_it: Figura 67: Il Tool Datagram Mode

source: Figure 68: The TMCL/PC Host
it_it: Figura 68: L'Host TMCL/PC

source: Figure 69: The Editor Settings Dialog
it_it: Figura 69 La finestra di dialogo "Editor Settings"

source: Figure 6: Tree with Connected Devices and their Tools
it_it: Figura 6: Albero con Dispositivi Connessi e Relativi Tool

source: Figure 70: Progress of the TMCL/PC Assembly
it_it: Figura 70: Avanzamento dell'Assemblaggio TMCL/PC

source: Figure 71: The TMCL/PC Options Dialog
it_it: Figura 71: Finestra di dialogo TMCL/PC Options

source: Figure 72: The Module Assignments Dialog
it_it: Figura 72: La Dialog "Module Assignments"

source: Figure 73: The Local Variables Window
it_it: Figura 73: La Finestra Local Variables

source: Figure 74: The Firmware Update Tool
it_it: Figura 74: Il Firmware Update Tool

source: Figure 75: The Wizard Window
it_it: Figura 75: La Finestra Wizard

source: Figure 76: The CANopen Connection Window
it_it: Figura 76: Finestra di Connessione CANopen

source: Figure 77: The LSS tab (with empty LSS device list)
it_it: Figura 77: La scheda LSS (con elenco dispositivi LSS vuoto)

source: Figure 78: The LSS device list contains two LSS devices and showing its context menu
it_it: Figura 78: L'elenco dei dispositivi LSS contiene due dispositivi LSS e mostra il relativo menu contestuale.

source: Figure 79: The Trace tab
it_it: Figure 79: Il tab Trace

source: Figure 7: The TMCL-IDE Main Window with user layout
it_it: Figura 7: La finestra principale di TMCL-IDE con layout utente

source: Figure 80: The UserEds directory
it_it: Figura 80: La directory UserEds

source: Figure 81: The Main Module Window
it_it: Figura 81: La Finestra del Modulo Principale

source: Figure 82: The Object Browser
it_it: Figura 82: L'Object Browser

source: Figure 83: The CiA-402 State Machine Tool
it_it: Figura 83: Il Tool della della Macchina a Stati CiA-402

source: Figure 84: The CiA-402 Profile Position Mode Tool
it_it: Figura 84: Il Tool CiA-402 Profile Position Mode

source: Figure 85: The CiA-402 Profile Velocity Mode Tool
it_it: Figura 85: Il Tool CiA-402 Profile Velocity Mode

source: Figure 86: The CiA-402 Homing Mode Tool
it_it: Figura 86: Il Tool The CiA-402 Homing Mode

source: Figure 87: The Parameter Save/Restore Tool
it_it: Figura 87: Il Tool Parameter Save/Restore

source: Figure 88: The PDO Receiver Tool
it_it: Figura 88: Il Tool PDO Receiver

source: Figure 89: The PDO Entry Context Menu
it_it: Figura 89: Il Menù PDO Entry Context

source: Figure 8: The USB Connection Window
it_it: Figura 8: La Finestra di Connessione USB

source: Figure 90: The PDO Graph Context Menu
it_it: Figura 90: Il Menù Contestuale del Grafico PDO

source: Figure 91: The PDO Transmitter Tool
it_it: Figura 91: Il Tool PDO Transmitter

source: Figure 92: The PDO Configurator Tool
it_it: Figura 92: Il Tool PDO Configurator

source: Figure 93: DCF File Generation
it_it: Figura 93: Generazione del file DCF

source: Figure 94: DCF File Usage
it_it: Figura 94: Utilizzo del File DCF

source: Figure 95: DCF Value Overview
it_it: Figura 95: Panoramica dei Valori DCF

source: Figure 96: DCF File Generation
it_it: Figura 96: Generazione di File DCF

source: Figure 97: The Expert Mode
it_it: Figura 97: L'Expert Mode

source: Figure 9: The Serial Port Connection Window
it_it: Figura 9: La Finestra di Connessione della Porta Seriale

source: Figure 57 shows the target and actual velocity during the tuning process:
it_it: La Figura 57 mostra la velocità target e quella effettiva durante il processo di regolazione:

source: Figures Index
it_it: Indice delle Figure

source: File Description
it_it: Descrizione del File

source: File: Shortcut ’alt gr + p’ allows shot of actual tool window as png file and to clipboard.
it_it: File: La scorciatoia 'alt gr + p' consente di visualizzare la finestra degli strumenti come file png e di salvarla negli appunti.

source: Filter enable (SAP 173): this parameter enables the StallGuard2 filter for more precision of the measurement.
it_it: Filter enable (SAP 173): questo parametro abilita il filtro StallGuard2 per una maggiore precisione della misurazione.

source: Finally release the mutual exclusion lock.
it_it: Infine, rilascia il lock di mutua esclusione.

source: Finally, click the Copy to code button to generate the module assignment commands.
it_it: Infine, cliccare sul pulsante Copy to code per generare i comandi di assegnazione del modulo.

source: Finally, create a new file and read its content, unmount the TF card and free up SPI bus resources when the test is complete.
it_it: Infine, crea un nuovo file e ne legge il contenuto, smonta la scheda TF e libera le risorse del bus SPI al termine del test.

source: Finally, if no I2C devices are found, print the appropriate message and use delay(5000) to pause the program for 5 seconds and scan again.
it_it: Infine, se non vengono trovati dispositivi I2C, visualizza il messaggio appropriato e utilizza delay(5000) per mettere in pausa il programma per 5 secondi e ripetere la scansione.

source: Finally, print "Draw color bar from top left to bottom right, the order is B - G - R", call the colorBarTest function to draw the color bar on the LCD, and turn on the LCD backlight.
it_it: Infine, stampa "Draw color bar from top left to bottom right, the order is B - G - R", chiama la funzione colorBarTest per disegnare la barra dei colori sull'LCD e accende la retroilluminazione dell'LCD.

source: Finally, start the console REPL, which allows users to interact with the application through the command line and perform various I2C operations, providing users with a convenient way to operate the I2C bus through the command line.
it_it: Infine, si avvia il REPL della console, che consente agli utenti di interagire con l'applicazione tramite la riga di comando ed eseguire diverse operazioni I2C, offrendo loro un modo pratico per gestire il bus I2C tramite la riga di comando.

source: Finally, the success status is returned
it_it: Infine, viene restituito lo stato di successo.

source: First both the P and I parameters are set to 0.
it_it: Innanzitutto, entrambi i parametri P e I vengono impostati a 0.

source: First disconnect the device from the computer.
it_it: Scollegare prima il dispositivo dal computer.

source: First initialize I2C, pull down the CS pin of the TF card through I2C control chip.
it_it: Per prima cosa, inizializza l'I2C, abbassando il pin CS della scheda TF tramite il chip di controllo I2C.

source: First print the information of the initialized TF card.
it_it: Per prima cosa, stampa le informazioni della scheda TF inizializzata.

source: First, enter the bank and the index of a local variable.
it_it: Innanzitutto, immettere il banco e l'indice di una variabile locale.

source: First, enter the start velocity and the end velocity.
it_it: Innanzitutto, immettere la velocità iniziale e quella finale.

source: First, it checks if any alarms have occurred.
it_it: Innanzitutto, verifica se ci sono allarmi.

source: First, it initializes serial port communication and sets the baud rate to 115200.
it_it: Innanzitutto, inizializza la comunicazione tramite porta seriale e imposta la velocità in baud a 115200.

source: First, it prints out "Initialize IO expander" to indicate the start of initializing the IO expander.
it_it: Innanzitutto, stampa "Initialize IO expander" per indicare l'avvio dell'inizializzazione dell'espansore IO.

source: First, read the lower 32 bits with the parameter <upper> set to 0 and then read the upper 32 bits with <upper> set to 255.
it_it: Per prima cosa, leggere i 32 bit inferiori con il parametro <upper> impostato a 0, quindi leggere i 32 bit superiori con <upper> impostato a 255.

source: First, some variables used to store the current ADC are defined, and the calibration function is declared.
it_it: Innanzitutto, vengono definite alcune variabili utilizzate per memorizzare il valore corrente dell'ADC e viene dichiarata la funzione di calibrazione.

source: First, the triggered alarm is read and the status information is obtained, and the corresponding processing is carried out according to different alarm conditions, such as printing error passive, bus error, receiving queue full and other alarm information and related counts.
it_it: Innanzitutto, l'allarme attivato viene letto e vengono ottenute le informazioni sullo stato, quindi viene eseguita l'elaborazione corrispondente in base a diverse condizioni di allarme, come errore di stampa passivo, errore del bus, coda di ricezione piena e altre informazioni di allarme e relativi conteggi.

source: First, variables were defined to store error codes, device addresses, and to record the number of devices found.
it_it: Innanzitutto, sono state definite delle variabili per memorizzare i codici di errore, gli indirizzi dei dispositivi e per registrare il numero di dispositivi rilevati.

source: Firstly, UART parameters were configured, including baud rate, data bits, parity bits, stop bits, and hardware flow control, etc.
it_it: Innanzitutto, sono stati configurati i parametri UART, tra cui baud rate, bit di dati, bit di parità, bit di stop e controllo di flusso hardware, ecc.

source: Firstly, constants and variables related to I2C are defined, such as log tags, the SDA and SCL pins for I2C, and port numbers.
it_it: Innanzitutto, vengono definite le costanti e le variabili relative a I2C, come i tag di log, i pin SDA e SCL per I2C e i numeri di porta.

source: Flags can also be dragged back from the toolbar to the flags view window.
it_it: I flag possono anche essere trascinati nuovamente dalla barra degli strumenti alla finestra di visualizzazione dei flag.

source: Flash Firmware Flashing and Erasing
it_it: Flash e Cancellazione del Firmware

source: Flash firmware flashing and erasing for reference
it_it: Flash e Cancellazione del Firmware per riferimento

source: Flash the demo
it_it: Flashare la demo

source: For Always set the parameter <upper> to 0 when reading from registers of up to 32 bits width.
it_it: Impostare sempre il parametro <upper> a 0 quando si legge da registri con larghezza fino a 32 bit.

source: For CAN interfaces that are equipped with only one port (which is the case for most CAN interfaces) this setting will not be shown.
it_it: Per le interfacce CAN dotate di una sola porta (come nel caso della maggior parte delle interfacce CAN), questa impostazione non verrà visualizzata.

source: For GT911 drivers, you can refer to this link
it_it: Per i driver GT911, fare riferimento a questo link

source: For RGB LCD drivers, please refer to this link
it_it: Per i driver LCD RGB, fare riferimento a questo link

source: For USB pin multiplexing
it_it: Per il multiplexing dei pin USB

source: For a smooth operation of the motor, an optimal set of P and I parameters are needed.
it_it: Per un funzionamento regolare del motore, è necessario un set ottimale di parametri P e I.

source: For classic constant off time chopper mode this parameter sets the fast decay time.
it_it: Per la modalità chopper classica con tempo di disattivazione costante, questo parametro imposta il tempo di decadimento rapido.
